---
kind: type
id: T:Autodesk.Revit.DB.LightAndMaterialAccuracyMode
source: html/47b82b85-fc31-5228-b679-73b7da543487.htm
---
# Autodesk.Revit.DB.LightAndMaterialAccuracyMode

An enumerated type containing possible Light and Material Accuracy modes for Raytracer render.

## Syntax (C#)
```csharp
public enum LightAndMaterialAccuracyMode
```